post-init.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle post-init.el
#+auto_tangle: t

* Introduction

  This file will generate a post-init.el file. This should be loaded from init.el with ~(load-file "path-to-post-init.el")~

* Lexical Binding

Feeling brave so attempting to see if this breaks my entire config.

#+BEGIN_SRC emacs-lisp

;; -*- lexical-binding: t -*-

  #+END_SRC

* Package Setup
** Straight Package Setup

Initialise [[https://github.com/radian-software/straight.el][Straight.el]] which is a better package manager

#+begin_src emacs-lisp

  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 6))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))

  (setq package-enable-at-startup nil)

#+end_src

** Use Package Setup

Install =use-package= which we will use for future packages (Combined with straight which is set as the default)

#+begin_src emacs-lisp

  (straight-use-package 'use-package)
  (setq straight-use-package-by-default t)

#+end_src


* General Emacs Setup
** Backups

[[https://www.gnu.org/software/emacs/manual/html_node/elisp/Backup-Files.html][Backup Docs]]

Change the backup handling to write to a specific directory to stop polluting git directories

*** Settings

- =backup-by-copying= provides more consistency
- =backup-directory-alist= sets backup directory to in home directory by default

#+BEGIN_SRC emacs-lisp

  (setq backup-by-copying t)
  (setq backup-directory-alist '(("." . "~/.emacs-backups/")))
  (setq delete-old-versions t)
  (setq kept-new-versions 6)
  (setq kept-old-versions 2)
  (setq version-control t)

#+END_SRC

** Ripgrep setup

Use ripgrep instead of grep by default

#+begin_src emacs-lisp
  (setq xref-search-program #'ripgrep)
#+end_src


* Appearance
** Emacs window frame

- Skip splash screen
- Default scratch buffer to empty
- Hide scrollbar
- Hide toolbar
- Hide menubar
- Enable tab-bar (with history)
- Always highlight current line
- Show column number in modeline
- Show line numbers except in terminal modes

#+begin_src emacs-lisp

  (use-package emacs
    :custom
    (inhibit-startup-message t)
    (initial-scratch-message nil)
    :config
    (scroll-bar-mode -1)
    (tool-bar-mode -1)
    (menu-bar-mode -1)
    (tab-bar-mode 1)
    (tab-bar-history-mode 1)
    (global-hl-line-mode +1)

    (column-number-mode)

    (global-display-line-numbers-mode t)
    (dolist (mode '(term-mode-hook
		    shell-mode-hook
		    eshell-mode-hook))
      (add-hook mode (lambda () (display-line-numbers-mode 0)))))

#+end_src

** Theme

- Use [[https://github.com/greduan/emacs-theme-gruvbox][gruvbox]] theme
- use Source Code Pro font

#+begin_src emacs-lisp

  (use-package gruvbox-theme
    :config (load-theme 'gruvbox-dark-medium t))

  (use-package emacs
    :config
    (set-face-attribute 'default nil :font "Source Code Pro" :height 140))

#+end_src

** ef-themes

Install ef-themes in case I get bored

#+BEGIN_SRC emacs-lisp

  (use-package ef-themes)

#+END_SRC

** Modeline setup

Use [[https://github.com/seagle0128/doom-modeline][Doom-modeline]] for modeline ([[https://github.com/domtronn/all-the-icons.el][all-the-icons]] is a dependency)

#+begin_src emacs-lisp

  (use-package all-the-icons
    :if (display-graphic-p))

  (use-package doom-modeline
    :init (doom-modeline-mode 1))

#+end_src


* Init Utilities
** General-Def

[[https://github.com/noctuid/general.el][General]] provides smarter key-bind setup.

#+BEGIN_SRC emacs-lisp

  (use-package general
   :demand
   :config
   (general-create-definer personal/leader-key
    :keymaps 'override
    :prefix "S-SPC")
   (general-create-definer personal/refactor
    :keymaps 'override
    :prefix "M-RET"))

 #+END_SRC

** Hydra

Hydra is a package for defining keyboard shortcuts in different ways

#+BEGIN_SRC emacs-lisp

  (use-package hydra)

#+END_SRC

* Help

** Which-Key Setup

[[https://github.com/justbur/emacs-which-key][which-key]] is a very useful tool for indicating what actions keys will do in various contexts.

#+BEGIN_SRC emacs-lisp

  (use-package which-key
   :custom (which-key-idle-delay 0.3)
   :config (which-key-mode))

#+END_SRC

** Helful Setup

[[https://github.com/Wilfred/helpful][helpful]] is a package that provides a more helpful help

#+begin_src emacs-lisp

	(use-package helpful
	  :general
	  ([remap describe-key] #'helpful-key)
	  ([remap describe-function] #'helpful-function)
	  ([remap describe-variable] #'helpful-variable)
	  ([remap describe-command] #'helpful-command))

#+end_src

* Version control

** Magit

Magit is the main git client being used

#+BEGIN_SRC emacs-lisp

  (use-package magit
   :custom (magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1))

#+END_SRC

*** Treemacs support

#+BEGIN_SRC emacs-lisp

    (use-package treemacs-magit
      :after (magit treemacs))

#+END_SRC

*** PR support

#+BEGIN_SRC emacs-lisp

  (use-package forge :after (magit))

#+END_SRC

*** Gitflow

#+BEGIN_SRC emacs-lisp

    (use-package magit-gitflow
      :hook 'magit-mode-hook (turn-on-magit-gitflow)
      :after (magit))

#+END_SRC

*** Show TODOs on Status

#+BEGIN_SRC emacs-lisp

  (use-package magit-todos
    :after magit
    :config (magit-todos-mode t))

#+END_SRC

** Git Gutter

Git gutter shows status of file in the fringe (left by default)

#+begin_src emacs-lisp
    (use-package git-gutter
      :config (global-git-gutter-mode +1))
#+end_src

* Navigation and Movement

** Emacs

Allow search to wrap around silently

#+BEGIN_SRC emacs-lisp

  (use-package emacs
    :custom
    (isearch-wrap-pause 'no-ding "Disable the pause and the ding when search wraps around"))

#+END_SRC

** Avy

Add avy for quick zipping around all open windows

#+begin_src emacs-lisp

  (use-package avy
    :bind ("C-'" . avy-goto-char-timer)
    :custom (avy-setup-default))

#+end_src

** Treemacs

*** Initial Setup

Use Treemacs as a kind of explorer like in vscode

#+BEGIN_SRC emacs-lisp

  (use-package treemacs
    :bind ("C-x t t" . treemacs)
    :config
    (treemacs-display-current-project-exclusively)
    (treemacs-project-follow-mode))

#+END_SRC

** Idle Highlight Mode

Highlight matches to the current symbol on idle

#+BEGIN_SRC emacs-lisp

  (use-package idle-highlight-mode
    :hook (prog-mode . idle-highlight-mode))

#+END_SRC

** SaveHist

[[https://www.emacswiki.org/emacs/SaveHist][savehist]] remembers minibuffer entries between sessions.
This is useful for tools like Vertico which sort based on this history

#+BEGIN_SRC emacs-lisp

  (use-package savehist
    :init
    (savehist-mode))

#+END_SRC

** Vertico

[[https://github.com/minad/vertico][Vertico]] Provides a vertical completion UI for emacs which is designed to work consistently in all situations

#+BEGIN_SRC emacs-lisp

  (use-package vertico
    :init
    (vertico-mode)
    :custom
    (vertico-cycle t "Vertico list cycles at the end")
    (read-extended-command-predicate #'command-completion-default-include-p "Hide commands not valid for the current mode")
    (enable-recursive-minibuffers t "Minibuffers can use minibuffers"))

#+END_SRC

** Marginalia

[[https://github.com/minad/marginalia][marginalia]] enriches the minibuffer with extra details

#+BEGIN_SRC emacs-lisp

  (use-package marginalia
    :init
    (marginalia-mode))

#+END_SRC

** Orderless

[[https://github.com/oantolin/orderless][orderless]] makes matches in completions more flexible to allow for matching on multiple parts of the string

#+BEGIN_SRC emacs-lisp

  (use-package orderless
    :custom
    (completion-styles '(orderless basic))
    (completion-category-defaults nil)
    (completion-category-overrides '((file (styles partial-completion)))))

#+END_SRC

** Corfu

[[https://github.com/minad/corfu][Corfu]] provides improvements to in-buffer completions

#+BEGIN_SRC emacs-lisp

  (use-package corfu
    :custom
    (corfu-cycle t)
    (corfu-auto t)
    (corfu-auto-delay 0)
    (corfu-auto-prefix 3)
    (corfu-separator ?\s)
    (completion-styles '(orderless))
    :init
    (global-corfu-mode))

#+END_SRC

** Cape

[[https://github.com/minad/cape][Cape]] - Completion at Point Extensions provides many more completion options

#+begin_src emacs-lisp

    (personal/leader-key "<SPC> t" '("complete-tag" . complete-tag))
    (use-package cape
      :config
      (personal/leader-key "<SPC> p" '("completion-at-point" . completion-at-point)) ;; capf
      (personal/leader-key "<SPC> t" '("complete-tag" . complete-tag))        ;; etags
      (personal/leader-key "<SPC> d" '("cape-dabbrev" . cape-dabbrev))        ;; or dabbrev-completion
      (personal/leader-key "<SPC> h" '("cape-history" . cape-history))
      (personal/leader-key "<SPC> f" '("cape-file" . cape-file))
      (personal/leader-key "<SPC> k" '("cape-keyword" . cape-keyword))
      (personal/leader-key "<SPC> s" '("cape-elisp-symbol" . cape-elisp-symbol))
      (personal/leader-key "<SPC> e" '("cape-elisp-block" . cape-elisp-block))
      (personal/leader-key "<SPC> a" '("cape-abbrev" . cape-abbrev))
      (personal/leader-key "<SPC> l" '("cape-line" . cape-line))
      (personal/leader-key "<SPC> w" '("cape-dict" . cape-dict))
      (personal/leader-key "<SPC> :" '("cape-emoji" . cape-emoji))
      (personal/leader-key "<SPC> \\" '("cape-tex" . cape-tex))
      (personal/leader-key "<SPC> _" '("cape-tex" . cape-tex))
      (personal/leader-key "<SPC> ^" '("cape-tex" . cape-tex))
      (personal/leader-key "<SPC> &" '("cape-sgml" . cape-sgml))
      (personal/leader-key "<SPC> r" '("cape-rfc1345" . cape-rfc1345)))

#+end_src

** Kind-Icon

[[https://github.com/jdtsmith/kind-icon][kind-icon]] shows icons in auto-completion frameworks where available

#+BEGIN_SRC emacs-lisp

  (use-package kind-icon
    :after corfu
    :custom
    (kind-icon-default-face 'corfu-default)
    :config
    (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

#+END_SRC


** Embark

[[https://github.com/oantolin/embark][embark]] offers contextual actions from hotkey (similar to a right click menu)

#+BEGIN_SRC emacs-lisp

  (use-package embark
    :general
    ("C-." #'embark-act)
    ("C-;" #'embark-dwim))

#+END_SRC

*** Embark-Consult

#+BEGIN_SRC emacs-lisp

  (use-package embark-consult
    :after (embark consult))

#+END_SRC

** IEdit Mode

IEdit mode is for selecting a symbol/word and replacing it in a buffer

#+begin_src emacs-lisp

  (use-package iedit
    :bind ("C-#" . iedit-mode))

#+end_src


* Org Mode

** Basic Setup

#+BEGIN_SRC emacs-lisp

;  (use-package org
;    :custom (org-ellipsis " ➤")
;    (org-log-done 'time)
;;    (org-agenda-start-with-log-mode t)
;    (org-duration-format (quote h:mm))
;    (custom-set-faces
;     '(org-level-1 ((t (:height 1.5))))
;     '(org-level-2 ((t (:height 1.4))))
;     '(org-level-3 ((t (:height 1.3))))))

  (use-package org
  :ensure t
  :custom
  (org-ellipsis " ➤")
  (org-log-done 'time)
  (org-agenda-start-with-log-mode t)
  (org-duration-format (quote h:mm))
  :config
  (custom-set-faces
   '(org-level-1 ((t (:height 1.5))))
   '(org-level-2 ((t (:height 1.4))))
   '(org-level-3 ((t (:height 1.3))))))


#+END_SRC

