post-init.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 6))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq package-enable-at-startup nil)

(straight-use-package 'use-package)
(setq straight-use-package-by-default t)

(setq backup-by-copying t)
(setq backup-directory-alist '(("." . "~/.emacs-backups/")))
(setq delete-old-versions t)
(setq kept-new-versions 6)
(setq kept-old-versions 2)
(setq version-control t)

(setq xref-search-program #'ripgrep)

(use-package emacs
  :custom
  (inhibit-startup-message t)
  (initial-scratch-message nil)
  :config
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (tab-bar-mode 1)
  (tab-bar-history-mode 1)
  (global-hl-line-mode +1)

  (column-number-mode)

  (global-display-line-numbers-mode t)
  (dolist (mode '(term-mode-hook
		  shell-mode-hook
		  eshell-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0)))))

(use-package gruvbox-theme
  :config (load-theme 'gruvbox-dark-medium t))

(use-package emacs
  :config
  (set-face-attribute 'default nil :font "Source Code Pro" :height 140))

(use-package all-the-icons
  :if (display-graphic-p))

(use-package doom-modeline
  :init (doom-modeline-mode 1))

(use-package general
 :demand
 :config
 (general-create-definer personal/leader-key
  :keymaps 'override
  :prefix "S-SPC")
 (general-create-definer personal/refactor
  :keymaps 'override
  :prefix "M-RET"))

(use-package hydra)

(use-package which-key
 :custom (which-key-idle-delay 0.3)
 :config (which-key-mode))

(use-package helpful
  :general
  ([remap describe-key] #'helpful-key)
  ([remap describe-function] #'helpful-function)
  ([remap describe-variable] #'helpful-variable)
  ([remap describe-command] #'helpful-command))

(use-package magit
 :custom (magit-display-buffer-function #'magit-display-buffer-fullframe-status-v1))

(use-package treemacs-magit
  :after (magit treemacs))

(use-package forge :after (magit))

(use-package magit-gitflow
  :hook 'magit-mode-hook (turn-on-magit-gitflow)
  :after (magit))

(use-package magit-todos
  :after magit
  :config (magit-todos-mode t))

(use-package git-gutter
  :config (global-git-gutter-mode +1))

(use-package emacs
  :custom
  (isearch-wrap-pause 'no-ding "Disable the pause and the ding when search wraps around"))

(use-package avy
  :bind ("C-'" . avy-goto-char-timer)
  :custom (avy-setup-default))

(use-package treemacs
  :bind ("C-x t t" . treemacs)
  :config
  (treemacs-display-current-project-exclusively)
  (treemacs-project-follow-mode))

(use-package idle-highlight-mode
  :hook (prog-mode . idle-highlight-mode))

(use-package savehist
  :init
  (savehist-mode))

(use-package vertico
  :init
  (vertico-mode)
  :custom
  (vertico-cycle t "Vertico list cycles at the end")
  (read-extended-command-predicate #'command-completion-default-include-p "Hide commands not valid for the current mode")
  (enable-recursive-minibuffers t "Minibuffers can use minibuffers"))

(use-package marginalia
  :init
  (marginalia-mode))

(use-package orderless
  :custom
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))

(use-package corfu
  :custom
  (corfu-cycle t)
  (corfu-auto t)
  (corfu-auto-delay 0)
  (corfu-auto-prefix 3)
  (corfu-separator ?\s)
  (completion-styles '(orderless))
  :init
  (global-corfu-mode))

(use-package cape)

(use-package kind-icon
  :after corfu
  :custom
  (kind-icon-default-face 'corfu-default)
  :config
  (add-to-list 'corfu-margin-formatters #'kind-icon-margin-formatter))

(use-package embark
  :general
  ("C-." #'embark-act)
  ("C-;" #'embark-dwim))

(use-package embark-consult
  :after (embark consult))

(use-package iedit
  :bind ("C-#" . iedit-mode))

(use-package org
  :custom (org-ellipsis " ➤")
  (org-log-done 'time)
  (org-agenda-start-with-log-mode t)
  (org-duration-format (quote h:mm)))
