post-init.org
** Org Bullets

More attractive org mode bullets to indicate header level

#+BEGIN_SRC emacs-lisp

  (use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode))

#+END_SRC

** Auto-Tangle

  Sets up Auto tangle on save

#+BEGIN_SRC emacs-lisp

  (use-package org-auto-tangle
    :defer t
    :hook (org-mode . org-auto-tangle-mode))

#+END_SRC

** Org Reveal

For creating reveal.js presentations in org mode

#+BEGIN_SRC emacs-lisp

  (use-package ox-reveal)

#+END_SRC

** org-download

[[https://github.com/abo-abo/org-download][org-download]] downloads images automatically from various sources including clipboard and screenshots:

#+BEGIN_SRC emacs-lisp

  (use-package org-download
    :after org
    :hook (dired-mode . org-download-enable)
    (org-mode . org-download-enable))

#+END_SRC

** org-inline-anim

[[https://github.com/shg/org-inline-anim.el][org-inline-anim]] animates inline images in org mode

#+BEGIN_SRC emacs-lisp

  (use-package org-inline-anim
    :custom (org-inline-anim-loop t)
    :hook (org-mode . org-inline-anim-mode))

#+END_SRC

** Org-Roam

#+BEGIN_SRC emacs-lisp

  (use-package org-roam
    :config (org-roam-db-autosync-mode))

#+END_SRC

* Programming
** General Programming Config

- Delete trailing whitespace (programming modes only)
- Show matching paren on closing paren

#+begin_src emacs-lisp

  (use-package emacs
    :config
    (add-hook 'prog-mode-hook
	      (lambda ()
		(add-hook 'before-save-hook 'delete-trailing-whitespace)))
    (show-paren-mode 1))

#+end_src

** Flycheck

[[https://www.flycheck.org/en/latest/][Flycheck]] is an on the fly syntax checker

#+BEGIN_SRC emacs-lisp

  (use-package flycheck
    :init
    (global-flycheck-mode))

#+END_SRC

** Parenthesis Configuration

*** Rainbow-Delimiters

Rainbow Delimiters alternates colours to better show the matched parens

#+BEGIN_SRC emacs-lisp

  (use-package rainbow-delimiters
   :hook (prog-mode . rainbow-delimiters-mode))

#+END_SRC

*** Structural Editing

Use paredit to ensure that parens cannot be unmatched

#+BEGIN_SRC emacs-lisp

  (use-package paredit
   :hook (clojure-mode . enable-paredit-mode)
   (emacs-lisp-mode . enable-paredit-mode)
   (lisp-mode . enable-paredit-mode))

#+END_SRC

** Snippets

*** Yasnippet Setup

Add snippet system (extended with other pacakges)

#+BEGIN_SRC emacs-lisp

  (use-package yasnippet
    :config (yas-global-mode 1))

#+END_SRC

** Treesitter

Treesitter is a non-regex way of allowing emacs to understand code structure

*** Initial Setup

Add language sources

#+begin_src emacs-lisp

      (setq treesit-language-source-alist '((typescript . ("https://github.com/tree-sitter/tree-sitter-typescript.git" nil "typescript/src"))
					    (tsx . ("https://github.com/tree-sitter/tree-sitter-typescript.git" nil "tsx/src"))
					    (dockerfile . ("https://github.com/camdencheek/tree-sitter-dockerfile.git" nil "src"))))

#+end_src

** Docker

[[https://github.com/Silex/docker.el][Docker]] package for managing docker containers and images

#+begin_src emacs-lisp

(use-package docker)

#+end_src

** Clojure
*** Add Clojure-Mode

[[https://github.com/clojure-emacs/clojure-mode][Clojure-Mode]]

#+begin_src emacs-lisp

    (use-package clojure-mode
      :hook ((clojure-mode . eglot-ensure)
	     (clojurec-mode . eglot-ensure)
	     (clojurescript-mode . eglot-ensure))
      :config (setq eldoc-idle-delay 2))

#+end_src

*** Extra font-locking for builtin symbols

#+begin_src emacs-lisp
    (use-package clojure-mode-extra-font-locking
      :after (clojure-mode))
#+end_src

*** Flycheck-Kondo for Clojure

For on-the-fly linting

#+begin_src emacs-lisp :ignore

  (use-package flycheck-clj-kondo
    :after (clojure-mode))

#+end_src

*** clj-refactor

To add extra refactorings

#+BEGIN_SRC emacs-lisp

  (use-package clj-refactor
    :hook ((clojure-mode . clj-refactor-mode)
	   (clojurec-mode . clj-refactor-mode)
	   (clojurescript-mode . clj-refactor-mode))
    :config
    (clj-refactor-mode 1)
    (cljr-add-keybindings-with-prefix "M-RET"))

#+END_SRC

*** Cider Setup

Add jack in support for a running REPL

#+BEGIN_SRC emacs-lisp

  (use-package cider
    :commands (cider cider-connect cider-jack-in)
    :custom
    (cider-eval-toplevel-inside-comment-form t)
    (clojure-toplevel-inside-comment-form t))

#+END_SRC

**** Portal Setup

Set up helpers for running [[https://github.com/djblue/portal][Portal]] an excellent data viewer and repl replacement for clojure

#+BEGIN_SRC emacs-lisp

  ;; Leverage an existing cider nrepl connection to evaluate portal.api functions
  ;; and map them to convenient key bindings.

  ;; def portal to the dev namespace to allow dereferencing via @dev/portal
  (defun portal.api/open ()
    (interactive)
    (cider-nrepl-sync-request:eval
      "(do (ns dev) (def portal ((requiring-resolve 'portal.api/open))) (add-tap (requiring-resolve 'portal.api/submit)))"))

  (defun portal.api/clear ()
    (interactive)
    (cider-nrepl-sync-request:eval "(portal.api/clear)"))

  (defun portal.api/close ()
    (interactive)
    (cider-nrepl-sync-request:eval "(portal.api/close)"))

  (setq personal/portal-keymap (make-sparse-keymap))
  (global-set-key (kbd "S-<SPC> p") (cons "portal" personal/portal-keymap))
  (global-set-key (kbd "S-<SPC> p o") '("open" . portal.api/open))
  (global-set-key (kbd "S-<SPC> p c") '("clear" . portal.api/clear))

#+END_SRC

***** Portal extensions

Add extensions to easily allow tapping without having to change the code.
`personal/portal-tap-viewers` can be set to customise the viewers that are available
(Thanks to https://github.com/sw1nn for improvements to the original script)

#+BEGIN_SRC emacs-lisp

  (defcustom personal/portal-tap-viewers '(":portal.viewer/inspector"
					   ":portal.viewer/pprint"
					   ":portal.viewer/table"
					   ":portal.viewer/tree"
					   ":portal.viewer/hiccup"
					   ":portal.viewer/tree")
    "List of viewers to be prompted when `C-u M-x personal/cider-tap-last-sexp`")

  (defun personal/cider-tap-last-sexp (&optional default-viewer)
    "Evaluate and tap the expression preceding point.
     If invoked with default-viewer, add this as metadata.
    If invoked with a single prefix argument, prompt for the viewer using the values defined in `personal/portal-tap-viewers`"
    (interactive (list (when (consp current-prefix-arg)
			 (completing-read "Default Viewer: " personal/portal-tap-viewers))))
    (cider-interactive-eval
     (if default-viewer
	 (concat "(tap> (vary-meta "
		 (apply #'buffer-substring-no-properties (cider-last-sexp 'bounds))
		 " merge {:portal.viewer/default "
		 default-viewer
		 "}))")
       (concat "(tap> " (apply #'buffer-substring-no-properties (cider-last-sexp 'bounds)) ")"))))

  (global-set-key (kbd "C-S-<return>") 'personal/cider-tap-last-sexp)

#+END_SRC

**** Cider Extra Functions

Extra functions for working in clojure.

Functions that kill the current symbol or line to the kill-ring. These are very useful for communicating code changes through messaging systems.

#+begin_src emacs-lisp

  (defun personal/get-namespace-for-symbol-dict(sym-dict)
    "Get the namespace from the provided `nrepl-dict`"
    (nrepl-dict-get sym-dict "ns"))

  (defun personal/get-symbol-name-for-symbol-dict(symbol-dict)
    "Get the symbol-name from the provided `nrepl-dict`"
    (nrepl-dict-get symbol-dict "name"))

  (defun personal/get-namespaced-symbol-for-symbol-dict(symbol-dict)
    "Get the namespaced symbol name from the provided `nrepl-dict`"
    (concat (personal/get-namespace-for-symbol-dict symbol-dict)
	    "/"
	    (personal/get-symbol-name-for-symbol-dict symbol-dict)))

  (defun personal/get-project-relative-file-path-for-current-file()
    "Get the path to the current file, relative to the project root"
    (file-relative-name (buffer-file-name) (clojure-project-root-path)))

  (defun personal/get-current-line-in-relative-file-path()
    "Get the path to the current file, relative to the project root followed by the line number"
    (concat (personal/get-project-relative-file-path-for-current-file)
	    ":"
	    (number-to-string (current-line))))

  (defun personal/kill-reference-to-symbol()
     "Kill a reference to the current namespaced symbol."
    (interactive)
    (let ((symbol-dict (cider-var-info (cider-symbol-at-point))))
      (kill-new (personal/get-namespaced-symbol-for-symbol-dict symbol-dict))))

  (defun personal/kill-reference-to-line()
    "Kill a reference to the current line in the file."
    (interactive)
    (kill-new (personal/get-current-line-in-relative-file-path)))

  (defun personal/kill-reference-to-namespace ()
    "Kill a reference to the current namespace"
    (interactive)
    (kill-new (substring-no-properties (clojure-find-ns))))

  (setq personal/kill-reference-keymap (make-sparse-keymap))
  (global-set-key (kbd "S-<SPC> k") (cons "kill-reference" personal/kill-reference-keymap))
  (global-set-key (kbd "S-<SPC> k s") '("kill-reference-to-symbol" . personal/kill-reference-to-symbol))
  (global-set-key (kbd "S-<SPC> k n") '("kill-reference-to-ns" . personal/kill-reference-to-namespace))
  (global-set-key (kbd "S-<SPC> k l") '("kill-reference-to-line" . personal/kill-reference-to-line))


  #+end_src

*** clj-deps-new

[[https://github.com/jpe90/emacs-clj-deps-new][clj-deps-new]] is a package for interacting with [[https://github.com/seancorfield/clj-new][clj-new]] and [[https://github.com/seancorfield/deps-new][deps-new]] for creating new projects from within emacs

#+BEGIN_SRC emacs-lisp

  (use-package clj-deps-new)

#+END_SRC

