post-init.org
*** Aggressive Indent

Aggressively indents code as you type.

#+begin_src emacs-lisp
  (use-package aggressive-indent
    :hook ((clojure-mode . aggressive-indent-mode)
	   (clojurec-mode . aggressive-indent-mode)
	   (clojurescript-mode . aggressive-indent-mode)))
#+end_src

*** yasnippet

Snippets for clojure

#+BEGIN_SRC emacs-lisp

  (use-package clojure-snippets
    :after yasnippet clojure-mode)

#+END_SRC

*** Project.el Config

Add detection for =deps.edn= as a project root file

#+begin_src emacs-lisp :tangle no
  (cl-defmethod project-root ((project (head personal/clojure)))
    (cdr project))

  (defun personal/sub-projects-clojure (dir)
    (if-let ((root (locate-dominating-file dir "deps.edn")))
	(cons 'personal/clojure root)))

  (add-hook 'project-find-functions #'project-try-vc 0)
  (add-hook 'project-find-functions #'personal/sub-projects-clojure -40)

#+end_src

** Common Lisp
*** Sly

The Common Lisp REPL

#+begin_src emacs-lisp

  (use-package sly)

  #+end_src

** Python

*** Basic setup

#+BEGIN_SRC emacs-lisp

  (setq python-indent-offset 4)
  (setq python-shell-interpreter "python3")

#+END_SRC

*** Elpy setup

[[https://github.com/jorgenschaefer/elpy][Elpy]] is a python IDE like experience for emaces

#+BEGIN_SRC emacs-lisp

  (use-package elpy
  :init
  (elpy-enable)
  :config
  (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
  (setq elpy-rpc-virtualenv-path 'current))

#+END_SRC

*** PyVenv setup

[[https://github.com/jorgenschaefer/pyvenv][PyVenv]] is a tool for managing python virtual environments in emacs

#+BEGIN_SRC emacs-lisp

  (use-package pyvenv
  :after elpy
  :config
  (setenv "WORKON_HOME" (expand-file-name "~/.local/share/virtualenvs/")))

#+END_SRC

*** Blacken Setup

[[https://github.com/pythonic-emacs/blacken][Blacken]] ensures that code complies with the Blacken style

#+BEGIN_SRC emacs-lisp

  (use-package blacken
  :hook (python-mode . blacken-mode))

#+END_SRC


*** Flake8 Setup

#+BEGIN_SRC emacs-lisp

  (setq flycheck-python-flake8-executable "/usr/bin/flake8")

#+END_SRC

** Rust

*** Initial setup

#+BEGIN_SRC emacs-lisp

  (use-package rust-mode
  :hook
  ((rust-mode . (lambda () (setq indent-tabs-mode nil)))
   (rust-mode . racer-mode)
   (rust-mode . flycheck-rust-setup)))

#+END_SRC

*** Racer setup

For autocompletion

#+BEGIN_SRC emacs-lisp

  (use-package racer
  :after rust-mode
  :hook
  (racer-mode . eldoc-mode))

#+END_SRC

*** Flycheck

Flycheck setup

#+BEGIN_SRC emacs-lisp

  (use-package flycheck-rust
  :after rust-mode
  :config
  (add-hook 'flycheck-mode-hook #'flycheck-rust-setup))

#+END_SRC

*** Cargo

Cargo integration

#+BEGIN_SRC emacs-lisp

  (use-package cargo
  :after rust-mode
  :hook
  (rust-mode . cargo-minor-mode))

#+END_SRC

** Web Development

*** Web mode

#+BEGIN_SRC emacs-lisp

  (use-package web-mode
  :straight t
  :mode (("\\.html?\\'" . web-mode)
         ("\\.css\\'" . web-mode)
         ("\\.js\\'" . web-mode))
  :config
  (setq web-mode-content-types-alist
        '(("jsx" . "\\.js[x]?\\'")))
  (setq web-mode-enable-auto-closing t)
  (setq web-mode-enable-auto-quoting t))

#+END_SRC

*** Emmet mode

#+BEGIN_SRC emacs-lisp

  (use-package emmet-mode
  :straight t
  :hook (web-mode css-mode sgml-mode))

#+END_SRC

*** Rainbow Mode

Shows colours in css files as colours

#+BEGIN_SRC emacs-lisp

  (use-package rainbow-mode
  :straight t
  :hook (web-mode css-mode))

#+END_SRC

*** Javascript and Typescript

#+BEGIN_SRC emacs-lisp

  (use-package js2-mode
    :straight t
    :mode "\\.js\\'")

  (use-package tide
    :straight t
    :after (typescript-mode company flycheck)
    :hook ((typescript-mode . tide-setup)
           (typescript-mode . tide-hl-identifier-mode)
           (before-save . tide-format-before-save)))

#+END_SRC

*** Linting and Formatting

#+BEGIN_SRC emacs-lisp

  (use-package prettier-js
    :straight t
    :hook ((web-mode js2-mode typescript-mode) . prettier-js-mode))

  (with-eval-after-load 'flycheck
    (flycheck-add-mode 'javascript-eslint 'web-mode)
    (flycheck-add-mode 'javascript-eslint 'js2-mode)
    (setq flycheck-javascript-eslint-executable "/usr/bin/eslint"))

#+END_SRC

*** Node.js

#+BEGIN_SRC emacs-lisp

  (use-package indium
  :straight t
  :hook (js2-mode . indium-interaction-mode))

#+END_SRC

** UUID Generator

Comes via [[https://nullprogram.com/blog/2010/05/11/][Chris Wellons]]. Generates a uuid in emacs. I use this only for generating uuids for test data.

#+BEGIN_SRC emacs-lisp

  (defun uuid-create ()
  "Return a newly generated UUID. This uses a simple hashing of variable data."
  (let ((s (md5 (format "%s%s%s%s%s%s%s%s%s%s"
			(user-uid)
			(emacs-pid)
			(system-name)
			(user-full-name)
			user-mail-address
			(current-time)
			(emacs-uptime)
			(garbage-collect)
			(random)
			(recent-keys)))))
    (format "%s-%s-3%s-%s-%s"
	    (substring s 0 8)
	    (substring s 8 12)
	    (substring s 13 16)
	    (substring s 16 20)
	    (substring s 20 32))))

  (defun uuid-insert ()
  "Inserts a new UUID at the point."
  (interactive)
  (insert (uuid-create)))

#+END_SRC

* Reading and Writing

** nov.el setup

Set up for reading epub files

#+BEGIN_SRC emacs-lisp

    (use-package nov
     :config (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

#+END_SRC

** RFC Mode

[[https://github.com/galdor/rfc-mode][rfc-mode]] allows access to rfcs within emacs

#+BEGIN_SRC emacs-lisp

  (use-package rfc-mode
    :custom
    (rfc-mode-directory (expand-file-name "~/.local/rfc")))

#+END_SRC

** adoc-mode

[[https://github.com/bbatsov/adoc-mode][adoc-mode]] allows reading and writing and highlighting for adoc files

#+begin_src emacs-lisp

  (use-package adoc-mode)

#+end_src

* Emacs Improvements

- Add shortcut for zap-up-to-char similar to zap-to-char
- Add imenu shortcut

#+BEGIN_SRC emacs-lisp

      (general-def
	"M-Z" 'zap-up-to-char
	"M-i" 'imenu)

#+END_SRC

* Emacs Window Management

Shell and repl windows appear at the bottom of the screen in a dedicated window when possible

#+begin_src emacs-lisp

  (setq switch-to-buffer-in-dedicated-window t)
  (add-to-list 'display-buffer-alist
	       '("\\*.*-?(?repl\\|e?shell)?.*\\*" display-buffer-in-side-window
		 (side . bottom)
		 (slot . 0)
		 (window-height . 0.3)
		 (window . root)
		 (dedicated . t)))

#+end_src

* Add REST Client

[[https://github.com/pashky/restclient.el][restclient]] is a package that allows sending of REST requests in emacs in a way similar to Postman

#+BEGIN_SRC emacs-lisp

  (use-package restclient)

#+END_SRC

* Add Terraform Package

[[https://github.com/hcl-emacs/terraform-mode][Terraform-mode]] is a mode that supports terraform syntax

#+BEGIN_SRC emacs-lisp

  (use-package terraform-mode
  :custom (terraform-indent-level 4))

#+END_SRC

* Eshell configuration

** Prompt setup

"[chris@Hestia|main [S:0 M:1 U:1]] ~/.config/emacs $"

#+BEGIN_SRC emacs-lisp

  (defun my/eshell-git-repo-status ()
  "Return a concise repo status string."
  (string-trim (shell-command-to-string
  		"git status --porcelain=v1 | awk 'BEGIN {staged=0; modified=0; untracked=0} /^M/ {modified++} /^M / {staged++} /^??/ {untracked++} END {sep=\"\"; if (staged > 0) {printf \"S\" staged; sep=\"|\"} if (modified > 0) {printf sep \"M\" modified; sep=\"|\"} if (untracked > 0) {printf sep \"U\" untracked} print \"\"}'"))
  )

  (defun my/eshell-git-prompt ()
    "Return the current branch and status for the eshell prompt"
    (let ((branch (magit-get-current-branch))
        (status (my/eshell-git-repo-status)))
    (when branch
      (concat "|"
              branch
              (if (not (string-empty-p status)) (concat "[" status "]"))))))

  (defun my/eshell-prompt ()
    "Return the full eshell prompt string"
    (concat "[" user-login-name "@" (system-name) (my/eshell-git-prompt) "] " (eshell/pwd) " $ "))

  (setq eshell-prompt-function 'my/eshell-prompt)


#+END_SRC

** Eshell Readonly

Make Eshell Readonly except where a traditional shell would allow editing

#+BEGIN_SRC emacs-lisp

  (defun my-read-only-eshell-prompt ()
    (let ((prompt (my/eshell-prompt)))
      (add-text-properties 0 (length prompt) '(read-only t) prompt)
      prompt))

    (setq eshell-prompt-function 'my-read-only-eshell-prompt)

    (defun my-read-only-eshell-output ()
      (let ((inhibit-read-only t)
  	    (beg (eshell-beginning-of-output))
  	    (end (eshell-end-of-output)))
        (put-text-property beg end 'read-only t)))

;    (add-hook 'eshell-output-filter-functions 'my-read-only-eshell-output)


#+END_SRC

** EShell Colour

#+BEGIN_SRC emacs-lisp

    (use-package xterm-color
    :ensure t
    :after eshell-mode
    :config
    ;; This will set `xterm-color-filter' as the filter for comint processes. This includes eshell,
    ;; but also other modes like shell-mode or compilation-mode.
    (setq comint-output-filter-functions
          (remove 'ansi-color-process-output comint-output-filter-functions))

    (add-hook 'comint-preoutput-filter-functions 'xterm-color-filter)

    ;; For eshell specifically
    (setq eshell-output-filter-functions
          (remove 'eshell-handle-ansi-color eshell-output-filter-functions))

    (add-to-list 'eshell-preoutput-filter-functions 'xterm-color-filter)
    )

    (add-hook 'eshell-before-prompt-hook
              (lambda ()
              (setq xterm-color-preserve-properties t)
  	    (setenv "TERM" "xterm-256color")))



#+END_SRC

* Japanese Language

Hiragana for marked region (requires kakasi installed)

#+BEGIN_SRC emacs-lisp

  (defun my/hiragana-conversion ()
  (interactive)
  (let* ((word (if (use-region-p)
                   (buffer-substring-no-properties (region-beginning) (region-end))
                 (thing-at-point 'word t)))
         (hiragana (shell-command-to-string (format "echo \"%s\" | kakasi -i \"utf-8\" -f -JH -KH" word))))
    (message "Hiragana: %s" hiragana)))

#+END_SRC

* Emoji setup

#+BEGIN_SRC emacs-lisp

  (when (member "Noto Color Emoji" (font-family-list))
  (set-fontset-font
    t 'symbol (font-spec :family "Noto Color Emoji") nil 'prepend))

#+END_SRC

* RSS

** Elfeed

RSS setup with Elfeed

#+BEGIN_SRC emacs-lisp

  (use-package elfeed)

#+END_SRC

*** Elfeed-org

#+BEGIN_SRC emacs-lisp

    (use-package elfeed-org
      :config (elfeed-org)
        (setq rmh-elfeed-org-files (list (expand-file-name "~/.config/emacs/elfeed.org"))))

#+END_SRC

* Eww Readable

Based on code from https://emacs.stackexchange.com/a/36287

#+BEGIN_SRC emacs-lisp

  (defun my/get-selected-region-or-prompt ()
  "Get the selected region's content or prompt the user if no region is selected."
  (if (use-region-p)
      (buffer-substring-no-properties (region-beginning) (region-end))
    (read-string "URL: ")))

  (defun my/eww-open-readable ()
  "Open URL in readable mode."
  (interactive)
  (letrec ((nonce (lambda ()
                    (unwind-protect
                        (eww-readable)
                      (remove-hook 'eww-after-render-hook nonce)))))
    (add-hook 'eww-after-render-hook nonce))
  (let ((selected-url (my/get-selected-region-or-prompt)))
    (eww selected-url)))

#+END_SRC

* Breadcrumb

Enable Breadcrumbs globally until I have time to be a little more custom

#+BEGIN_SRC emacs-lisp

    (use-package breadcrumb
      :config (breadcrumb-mode))

#+END_SRC

* ChatGPT

ChatGPT Integration currently uses my fork which adds a couple of features I use often

#+BEGIN_SRC emacs-lisp

  (straight-use-package
   '(openai :type git :host github :repo "emacs-openai/openai"))

  (straight-use-package
   '(chatgpt :type git :host github :repo "emacs-openai/chatgpt"
              :fork (:host github
  			 :repo "cwchriswilliams/chatgpt"
  			 :branch "customised-fork-behaviour")))

#+END_SRC
