post-init.el

(use-package aggressive-indent
  :hook ((clojure-mode . aggressive-indent-mode)
	 (clojurec-mode . aggressive-indent-mode)
	 (clojurescript-mode . aggressive-indent-mode)))

(use-package clojure-snippets
  :after yasnippet clojure-mode)

(use-package sly)

(defun uuid-create ()
"Return a newly generated UUID. This uses a simple hashing of variable data."
(let ((s (md5 (format "%s%s%s%s%s%s%s%s%s%s"
		      (user-uid)
		      (emacs-pid)
		      (system-name)
		      (user-full-name)
		      user-mail-address
		      (current-time)
		      (emacs-uptime)
		      (garbage-collect)
		      (random)
		      (recent-keys)))))
  (format "%s-%s-3%s-%s-%s"
	  (substring s 0 8)
	  (substring s 8 12)
	  (substring s 13 16)
	  (substring s 16 20)
	  (substring s 20 32))))

(defun uuid-insert ()
"Inserts a new UUID at the point."
(interactive)
(insert (uuid-create)))

(use-package nov
 :config (add-to-list 'auto-mode-alist '("\\.epub\\'" . nov-mode)))

(use-package rfc-mode
  :custom
  (rfc-mode-directory (expand-file-name "~/.local/rfc")))

(use-package adoc-mode)

(general-def
  "M-Z" 'zap-up-to-char
  "M-i" 'imenu)

(setq switch-to-buffer-in-dedicated-window t)
(add-to-list 'display-buffer-alist
	     '("\\*.*-?(?repl\\|e?shell)?.*\\*" display-buffer-in-side-window
	       (side . bottom)
	       (slot . 0)
	       (window-height . 0.3)
	       (window . root)
	       (dedicated . t)))

(use-package restclient)

(use-package terraform-mode
:custom (terraform-indent-level 4))
